package java1.day01;

import javax.print.attribute.SetOfIntegerSyntax;

public class Ex2_타입 {

	public static void main(String[] args) {
		
		int var1 = 0b1011; // 데이터 앞에 0b를 사용하면 2진수 표현
			System.out.println("var1: "+var1); // 10진수11 -> int는 10진수로 출력됨
		
		int var2= 0206; //데이터 앞에 0
			System.out.println("var2: "+var2); // 8진수
			
		int var3= 365; //10진수
		
		int var4=0xB3; // 16진수, 데이터 앞에 0x
		
//--------------------------------------------------------------------------------
		byte b1= -128; 
			System.out.println(b1); // 가능
		byte b2= 127;
			System.out.println(b2);// 가능
	//	byte b3= 200;
	//		System.out.println(b3); // 오류 (허용 범위를 벗어남) -> Type mismatch
		
//--------------------------------------------------------- -----------------------
			short s1= 3200;  // 가능
			// short s2= -50000  // 오류. 범위 멋어남

//-------------------------------------------------------------------------------
			int i1=2000000000; // 가능
			// int i2=3000000000; // 오류. 범위 벗어남
			
//----------------------------------------------------------------------------
			long l1=10; // 가능.
			// long l2=3000000000; // 오류남. 우리가 코드로 작성한 정수는 int타입임. 
			long l3=3000000000L; // 가능. 직접 작성한 정수를 long 타입으로 변경 (정수 뒤에 L 붙이기)
			
//-----------------------------------------------------------------------------------
			char c1='A';  //작은따옴표사용
			System.out.println(c1); //A
			
			char c2=65;
			System.out.println(c2);  //A
			
			char c3='가'; 
			System.out.println(c3) ;// 가
			
			char c4=44032;
			System.out.println(c4);  //가
			
			
//-----------------------------------------------------------------------------------
			// string클래스 [문자열 저장 ] "" : 타입 아님
			// 메모리 크기 정해져 있지 않음. 글자수에 따라 다름. 허용범위 없음. 
			// int, char 등 바이트 정해져 있음
			
			String str1= "안녕하세요";
			System.out.println(str1);  //안녕하세요
			
			
//---------------------------------------------------------------------------------
			//float타입 : 소수 8자리 표현 가능(4바이트) / double: 17자리 표현 가능(8바이트)
			//float f1=0.123456789; // 오류, 기본타입이 double
			float f1 = 0.123456789f; // 가능. f는 반드시 써줘야됨.
			
			//double : 실수 기본타입
			double d1= 0.1234567890044; // 가능. 17자리까지 표현.
			
//-------------------------------------------------------------------------------
			//논리 타입 boolean (1bit) 0:false / 1:true
			
	} //main 끝

}

/*
 	타입/ 자료형
 */
