package 과제.과제5;

import java.util.Scanner;

public class 키오스크복습 {
	
	public static void main(String[] args) {
		
		Scanner scanner = new Scanner(System.in);
		
		String 재고관리 = "";
		/* 재고관리 변수 샘플  */
		재고관리 = "300,10,0\n200,10,0\n,100,10,0\n";
	
		
		/* ----------- */
		
		while(true) {
			System.out.println("\n\n-------------------- 메뉴 ------------------- ");
			System.out.println("1.콜라[300] 2.환타[200] 3.사이다[100] 4.결제");
			System.out.print(">>>>>> 선택 : "); int ch = scanner.nextInt();
			
			/* 문제풀이 위치 */
			// 문자열 split 배열로 받기. 
			String 콜라=재고관리.split("\n")[0];
			String 환타 = 재고관리.split("\n")[1];
			String 사이다= 재고관리.split("\n")[2];

			int 콜라가격= Integer.parseInt(콜라.split(",")[0]);
			int 콜라재고= Integer.parseInt(콜라.split(",")[1]);
			int 콜라장바구니= Integer.parseInt(콜라.split(",")[2]);
			int	환타가격= Integer.parseInt(환타.split(",")[0]);
			int 환타재고= Integer.parseInt(환타.split(",")[1]);
			int 환타장바구니= Integer.parseInt(환타.split(",")[2]);
		//	System.out.println("int형 변경 확인"+환타가격+환타재고+환타장바구니);

//??	Exception in thread "main" java.lang.NumberFormatException: For input string: "" 		
			int	사이다가격= Integer.parseInt(사이다.split(",")[0]);
			int 사이다재고= Integer.parseInt(사이다.split(",")[1]);
			int 사이다장바구니= Integer.parseInt(사이다.split(",")[2]);
			
//콜라선택-------------------------------------------------------------			
			if(ch==1) {//콜라선택
				//장바구니 계산을 위해 int형으로 변경해 저장
				if(콜라재고>0) {//재고가 있다면
					콜라재고--;
					콜라장바구니++;
					System.out.println("구매성공");
					System.out.println("콜라재고: "+콜라재고);
					System.out.println("콜라장바구니: "+콜라장바구니);
					}//재고가 있다면
				else {System.out.println("재고부족");}
			}//콜라선택
//환타선택----------------------------------------------------------------			
			if(ch==2) {//환타선택
				
				if(환타재고>0) {//재고가 있다면
					환타재고--;
					환타장바구니++;
					System.out.println("구매성공");
					System.out.println("환타재고: "+환타재고);
					System.out.println("환타장바구니: "+환타장바구니);
				}//재고가 있다면
				else {System.out.println("재고부족");}
			}//환타선택
			
//사이다선택--------------------------------------------------------------
			if(ch==3) {//사이다선택
				
				if(사이다재고>0) {//재고가 있다면
					사이다재고--;
					사이다장바구니++;
					System.out.println("구매성공");
					System.out.println("사이다재고: "+사이다재고);
					System.out.println("사이다장바구니: "+사이다장바구니);
				}//재고가 있다면
				else {System.out.println("재고부족");}				
			}//사이다선택
//결제선택---------------------------------------------------------------
			if(ch==4) {//ch결제선택
				System.out.println("현재 장바구니 현황 표시 목록");
				System.out.println("----------------------");
				System.out.printf("%2s%5s%5s","제품명","수량","가격");
				if(콜라장바구니!=0) {//콜라장바구니에 있는 항목이면
					System.out.printf("%s%5d%5d","콜라",콜라장바구니,(콜라장바구니*콜라가격));
				}//콜라장바구니에 있는 항목이면
				if(환타장바구니!=0) {//환타장바구니에 있는 항목이면
					System.out.printf("%s%5d%5d","환타",환타장바구니,(환타장바구니*환타가격));
				}//환타장바구니에 있는 항목이면
				if(사이다장바구니!=0) {//사이다장바구니에 있는 항목이면
					//System.out.printf("%s%5d%5d","사이다",사이다장바구니,(사이다장바구니*사이다가격));
				}//사이다장바구니에 있는 항목이면
			
			System.out.println("-----------------------");
			System.out.println("1.결제  2.취소");
			System.out.println("-----------------------");
			System.out.println("결제여부: "); int 결제=scanner.nextInt();
//결제선택-결제--------------------------------------------------------------------				
			if(결제==1) {//1. 결제 눌렀을 때. 
				//int 총가격=콜라장바구니*콜라가격+환타장바구니*환타가격+사이다장바구니*사이다가격;
				
				System.out.println("넣을돈: "); int 넣을돈=scanner.nextInt();
//확인				
					if(넣을돈>=0) {// 넣을돈>=총가격 . 결제성공
					System.out.println("잔액: "+(넣을돈-0));
					System.out.println("결제성공");
					System.out.println("재고: 상태"+콜라재고+환타재고+사이다재고);
					콜라장바구니=0; 환타장바구니=0; 사이다장바구니=0;
					System.out.println("장바구니상태: " +콜라장바구니+환타장바구니+사이다장바구니);
			
				}//결제성공
		
				else {//결제실패
					System.out.println("금액이 부족함");
					콜라재고+=콜라장바구니; 환타재고+=환타장바구니; 사이다재고+=사이다장바구니;
					콜라장바구니=0; 환타장바구니=0; 사이다장바구니=0;
					System.out.println("바구니상태: "+콜라장바구니+사이다장바구니+환타장바구니);
					System.out.println("재고상태: "+콜라재고+"   "+사이다재고+"   "+환타재고);
				}//금액부족으로 결제실패
			}//1.결제 눌렀을 때
			
			
//결제선택-취소------------------------------------------------------------------				
			else {//2.취소 눌렀을때. 장바구니 초기화, 재고 되돌리기
				System.out.println("결제취소");
				콜라재고+=콜라장바구니; 환타재고+=환타장바구니; 사이다재고+=사이다장바구니;
				콜라장바구니=0; 환타장바구니=0; 사이다장바구니=0;
				System.out.println("바구니상태: "+콜라장바구니+사이다장바구니+환타장바구니);
				System.out.println("재고상태: "+콜라재고+"   "+사이다재고+"   "+환타재고);
				break;
			}//2. 취소 눌렀을때
			
						
			
			}//ch결제선택
			
			
					
			/* ----------- */
			
		} // while end 
	} // main end 
	
} // class end 

/*

	 주제 : 키오스크(변수버전)
	 	- 실행예시 사진은 없습니다.
		조건 
		1. 제품 가격/재고/바구니 상태를 하나의 문자열 변수에서 관리 
			// 샘플 : 
					이름 : 콜라 , 환타 , 사이다
					가격 : 300 , 200 , 100
					바구니 : 0 , 0 , 0
			
		2. 키오스크 메뉴 [ 무한루프 : 종료 없음(24시간) ] 
			1. 콜라 2.사이다 3.환타 4.결제
			[ 1~3 선택시 ]
				- 재고가 있을경우 장바구니 담기 / 없으면 '재고부족' 출력
				 
			[ 4 선택시 ] 
				- 현재 장바구니 현황 표시 목록 
				----------------------------------
				제품명	수량	가격
				사이다	1	400
				환타		2	1000
				총가격 : 1400
				- 결제메뉴 표시
					1. 결제 2.취소 
					[결제]
						- 금액 입력받아 총가격에 뺀 잔액 출력 -> 결제 성공시 장바구니 초기화 
						- 만약에 금액이 부족하면 결제 취소 -> 장바구니 초기화 / 재고 다시 되돌리기
					[취소]
						- [ 장바구니 초기화 / 재고 다시 되돌리기 ]
 
 */







