package java1.day08;

public class Ex1_객체 {

	public static void main(String[] args) {

		
	}

}

/*
 * 객체지향 프로그래밍 : OOP
 * - 부품을 먼저 만들고 그 부품들을 하나씩 조립해서 완성품을 만드는 작업
 * - 객체를 먼저 각각 만들고 서로 다른 객체들을 하나씩 조립(합쳐) 하나의 프로그램을 만드는 작업
 * - Ex1) 블럭1개= 객체1개  => 블럭 여러개= 레고 완성품
 * 
 * 객체란
 * - 물리적으로 존재하거나 개념적으로 존재하는 것 중 식별 가능한 것.(사전적정의)
 * - 물리적 존재: 자동차, 자전거, 책, 사람= 손에 잡히는 형태
 * - 개념적인 존재: 학과, 강의, 주문 등 (눈에 보이지 않는 개념적인 것도 객체화 할 수 있음)
 * 
 * 객체의 속성/필드 과 동작/메소드/행동
 * - 속성/필등/상태: 이름, 나이, 색깔, 속도
 * - 동작/메소드/행동 : 웃다, 먹다 
 * 
 * 객체 모델링: 현실 세계의 객체를 컴퓨터로 옮기는 과정[메소드/필드를 만드는 과정]
 * 
 * 객체의 상호작용 : 사람객체와 붕어빵객체는 상호작용 가능
 * 사람객체1
 * 		이름:강호동
 * 		행동: 먹다
 * 
 * 사람객체2
 * 		이름: 유재석
 * 		행동: 먹다
 * 
 * 붕어빵객체1
 * 		함량: 밀가루 0.5g
 * 		구매자: 강호동
 * 붕어빵객체2
 * 		함량: 밀가루 0.5g 
 * 		구매자: 유재석
 * 
 * - 서로 다른 객체들은 메소드/함수를 통해 서로 데이터를 주고 받음. 
 * 
 * 객체지향 프로그램의 특징
 * 1. 캡슐화: 필드,동작을 하나로 묶어 외부 다른 객체로부터 감추는 것
 * 2. 상속: 상위 객체로부터 필드,동작(메소드)를 물려 받아 하위 객체가 사용할 수 있는 것
 * 3. 다형성: 사용방법은 같지만 실행 결과는 다양하게 나오는 성질
 */
