package java1.day08;

public class SportsCar {

}

class Tire{
	
}

/*
 * 객체와 클래스
 * 	- 객체를 생성할 때에는 설계도/클래스가 필요
 * 
 * 개발자--> 클래스 생성--> 클래스(설계도) -->인스턴스화 -------->인스턴스1(객체)
 * 									(new연산자)-------->인스턴스2(객체)
 
 *
 *						붕어빵틀 ---------------------->서로 다른 붕어빵 들
 								 굽기
 *
 *
 *- 클래스 사용 목적
 *	1. 객체를 생성하기 위한 설계도
 *	2. 객체를 만들지 않더라도 실행할 목적
 *	3. (MVC) 각 코드 역할 분담하는 목적(코드의 역할 분담) <- 협업
 *
 *- 클래스 선언
 *	-구성
 *		1. 어떻게 객체를 생성(생성자) : 객체 생성자 초기값(처음)을 필드에 저장 담당하는 메소드 (추가적인 것들에 대한 초기값을 말함.)
 *		2. 가져야 할 데이터(필드) : 객체의 상태/속성, 주로 변수와 동일함(비슷하지 동일한건 아님)
 *		3. 객체의 행동(메소드): 객체의 행동/이벤트
 *
 * - 클래스명 변수명= new 생성자();
 * 	Scanner scanner= new Scanner(System.in);  <- System.in은 인수!!
 */
